# Pandas
## Flexible and powerful data analysis / manipulation library for Python

## Series
#### Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(dtype=int) # For creating empty series

Series([], dtype: int64)

In [3]:
data = np.array(['a','b','c','d']) # When data is numpy ndarray
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
s[0]

'a'

In [5]:
s.tolist() # converts to list

['a', 'b', 'c', 'd']

#### We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data) - 1

In [6]:
s1 = pd.Series(data,index=[100,101,102,103]) # Pass indexes as length of data
s1

100    a
101    b
102    c
103    d
dtype: object

In [7]:
s1[100]

'a'

### Create a Series from dict
#### A dict can be passed as input and if no index is specified, then the dictionary keys are taken in a sorted order to construct index.

In [8]:
s2 = pd.Series({"name":"abc", "age":25})
s2

name    abc
age      25
dtype: object

In [9]:
s3 = pd.Series({"name":"abc", "age":25}, index=['age', 'name', 'id'])
s3

age      25
name    abc
id      NaN
dtype: object

### Create a Series from Scalar
#### If data is a scalar value, an index must be provided. The value will be repeated to match the length of index.

In [10]:
s4 = pd.Series(5, index=[0, 1, 2, 3])
s4

0    5
1    5
2    5
3    5
dtype: int64

#### Accessing Data from Series with Position

In [11]:
s[1]

'b'

#### Retrieve Data Using Label (Index)

In [12]:
s2['name']

#retrieve multiple elements
s2[['name','age']]

name    abc
age      25
dtype: object

In [13]:
s5 = pd.Series([['abc',10, 2500],['pqr',8 , 2400]])
s5[0]

['abc', 10, 2500]

##  string operations

### lower() - Converts strings in the Series/Index to lower case
### upper() - Converts strings in the Series/Index to upper case
### len() - Computes String length()
### strip() - Helps strip whitespace(including newline) from each string in the Series/index from both the sides
### splits() - Splits each string with the given pattern
### cat(sep=' ') - Concatenates the series/index elements with given separator
### get_dummies() - Returns the DataFrame with One-Hot Encoded values
### contains(pattern) - Returns a Boolean value True for each element if the substring contains in the element, else False
### replace(a,b) - Replaces the value a with the value b
### repeat(value) - Repeats each element with specified number of times
### count(pattern) - Returns count of appearance of pattern in each element
### startswith(pattern) - Returns true if the element in the Series/Index starts with the pattern
### endswith(pattern) - Returns true if the element in the Series/Index ends with the pattern
### find(pattern) - Returns the first position of the first occurrence of the pattern
### findall(pattern) - Returns a list of all occurrence of the pattern
### swapcase - Swaps the case lower/upper
### islower() - Checks whether all characters in each string in the Series/Index in lower case or not. Returns Boolean
### isupper() - Checks whether all characters in each string in the Series/Index in upper case or not. Returns Boolean
### isnumeric() - Checks whether all characters in each string in the Series/Index are numeric. Returns Boolean

In [14]:
s.str.upper()

0    A
1    B
2    C
3    D
dtype: object

In [15]:
s.str.split(' ')

0    [a]
1    [b]
2    [c]
3    [d]
dtype: object

In [16]:
s

0    a
1    b
2    c
3    d
dtype: object

In [17]:
s.str.get_dummies()

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1

# DataFrame
#### A dataframe is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns.

### * Each column in a DataFrame is a Series
### * single column selection - result is a pandas Series.

### * A pandas DataFrame can be created using various inputs like - lists, dict, series, numpy ndarrays, another dataframe

## Create an Empty DataFrame

In [18]:
# empty dataframe
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [19]:
len(df)

0

## Create a DataFrame from Lists

In [20]:
df1 = pd.DataFrame([1,2,3]) # create df with list input
df1

   0
0  1
1  2
2  3

In [21]:
df2 = pd.DataFrame([['abc',10, 2500],['pqr',8 , 2400]]) # 2 rows 3 columns
df2

     0   1     2
0  abc  10  2500
1  pqr   8  2400

In [22]:
df2[0][1] # first will be column index second will be row index

'pqr'

In [23]:
df2[2][1]

np.int64(2400)

In [24]:
df3 = pd.DataFrame([['abc',10, 2500],['pqr',8 , 2400],['def',12, 1800],['xyz',20, 1100]]) # 4 rows, 3 columns
df3

     0   1     2
0  abc  10  2500
1  pqr   8  2400
2  def  12  1800
3  xyz  20  1100

In [25]:
df3[2][1]

np.int64(2400)

In [26]:
data = [['nikh', 25]]
df4 = pd.DataFrame(data, columns=['Name', 'Age'])
print(df4)

   Name  Age
0  nikh   25

## Create a DataFrame from List of Dicts
#### The dictionary keys are by default taken as column names.

In [27]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
dff = pd.DataFrame(data)
dff

   a   b     c
0  1   2   NaN
1  5  10  20.0

## Create a DataFrame from Dict of ndarrays / Lists
#### All the ndarrays must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.

In [28]:
data = {'Name':['ABC', 'DEF', 'GHF', 'IJK'],'Age':[24,25,23,21]}
df5 = pd.DataFrame(data)
df5

  Name  Age
0  ABC   24
1  DEF   25
2  GHF   23
3  IJK   21

### Indexed DataFrame

In [29]:
data = {'Name':['ABC', 'DEF', 'GHF', 'IJK'],'Age':[24,25,23,21]}
df6 = pd.DataFrame(data, index=['rank1', 'rank2', 'rank3', 'rank4']) # labled index(Row)
df6

      Name  Age
rank1  ABC   24
rank2  DEF   25
rank3  GHF   23
rank4  IJK   21

In [30]:
df6['Name']['rank3'] # Access using labled index

'GHF'

In [31]:
data = [{'abc': 10, 'def': 21, 'ghi':23},{'jkl': 12, 'mno': 11}]
df7 = pd.DataFrame(data, index=['first', 'second'], columns=['mno','jkl','ghi','def','abc', 'some']) 
df7

         mno   jkl   ghi   def   abc  some
first    NaN   NaN  23.0  21.0  10.0   NaN
second  11.0  12.0   NaN   NaN   NaN   NaN

## Create a DataFrame from Dict of Series

In [32]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df8 = pd.DataFrame(d) # 2 rows 4 columns
df8

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [33]:
df8['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [34]:
df8['three']=pd.Series([10,20,30],index=['a','b','c'])
df8

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [35]:
df8['four']=df8['one']+df8['three']
df8

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

### Column Deletion

In [36]:
df8

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [37]:
del df8['one']

In [38]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

# Drop

In [39]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [40]:
df8.drop(index=['b']) # Drop by row indexs

   two  three  four
a    1   10.0  11.0
c    3   30.0  33.0
d    4    NaN   NaN

In [41]:
df8.drop(columns=['two']) # Drop by columns

   three  four
a   10.0  11.0
b   20.0  22.0
c   30.0  33.0
d    NaN   NaN

In [42]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

## Methods
### count() - Number of non-null observations
### sum() - Sum of values
### mean() - Mean of Values
### median() - Median of Values
### mode() - Mode of values
### std() - Standard Deviation of the Values
### min() - Minimum Value
### max() - Maximum Value
### abs() - Absolute Value - throw exception when the DataFrame contains character or string data 
### prod() - Product of Values
### cumsum() - Cumulative Sum
### cumprod() - Cumulative Product - throw exception when the DataFrame contains character or string data

In [43]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [44]:
df8.count()

two      4
three    3
four     3
dtype: int64

In [45]:
df8.sum()

two      10.0
three    60.0
four     66.0
dtype: float64

In [46]:
df8.mean()

two       2.5
three    20.0
four     22.0
dtype: float64

In [47]:
df8.median()

two       2.5
three    20.0
four     22.0
dtype: float64

In [48]:
df8.mode()

   two  three  four
0    1   10.0  11.0
1    2   20.0  22.0
2    3   30.0  33.0
3    4    NaN   NaN

In [49]:
df8.std()

two       1.290994
three    10.000000
four     11.000000
dtype: float64

In [50]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [51]:
df8.cumsum()

   two  three  four
a    1   10.0  11.0
b    3   30.0  33.0
c    6   60.0  66.0
d   10    NaN   NaN

In [52]:
df8.cumprod()

   two   three    four
a    1    10.0    11.0
b    2   200.0   242.0
c    6  6000.0  7986.0
d   24     NaN     NaN

## Summarizing Data
### describe() -  computes a summary of statistics pertaining to the DataFrame columns

In [53]:
df8

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [54]:
 df8.describe()

            two  three  four
count  4.000000    3.0   3.0
mean   2.500000   20.0  22.0
std    1.290994   10.0  11.0
min    1.000000   10.0  11.0
25%    1.750000   15.0  16.5
50%    2.500000   20.0  22.0
75%    3.250000   25.0  27.5
max    4.000000   30.0  33.0

### Gives summary about numeric columns
### 'include' -  argument used to pass necessary information regarding what columns need to be considered for summarizing.
#### - object :  Summarizes String columns
#### - number  : Summarizes Numeric columns
#### - all :  Summarizes all columns together -  Should not pass it as a list value

In [55]:
df8.describe(include='number')

            two  three  four
count  4.000000    3.0   3.0
mean   2.500000   20.0  22.0
std    1.290994   10.0  11.0
min    1.000000   10.0  11.0
25%    1.750000   15.0  16.5
50%    2.500000   20.0  22.0
75%    3.250000   25.0  27.5
max    4.000000   30.0  33.0

In [56]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
df = pd.DataFrame(d)
df.describe(include='all')

       Name        Age     Rating
count    12  12.000000  12.000000
unique   12        NaN        NaN
top     Tom        NaN        NaN
freq      1        NaN        NaN
mean    NaN  31.833333   3.743333
std     NaN   9.232682   0.661628
min     NaN  23.000000   2.560000
25%     NaN  25.000000   3.230000
50%     NaN  29.500000   3.790000
75%     NaN  35.500000   4.132500
max     NaN  51.000000   4.800000

## Function Application
### methods to operate on an entire DataFrame, row- or column-wise, or element wise.

## * Table wise: pipe()

In [57]:
def adder(ele1,ele2):
   return ele1+ele2

In [58]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df.pipe(adder, 100) # add a value 100 to all the elements in the DataFrame

         col1        col2        col3
0  100.878415  101.535639  100.919717
1  100.129270  100.660898   99.231235
2  101.672284  100.977188  100.858428
3  100.081641   99.537393  101.131533
4   98.741494   99.921294  100.921797

## * Row or Column Wise : apply()
### - The operation performs column wise, taking each column as an array-like

In [59]:
df

       col1      col2      col3
0  0.878415  1.535639  0.919717
1  0.129270  0.660898 -0.768765
2  1.672284  0.977188  0.858428
3  0.081641 -0.462607  1.131533
4 -1.258506 -0.078706  0.921797

In [60]:
df.apply(np.mean)

col1    0.300621
col2    0.526483
col3    0.612542
dtype: float64

In [61]:
df.apply(np.mean,axis=1) # By passing axis parameter, operations can be performed row wise. Axis=0 -> column, Axis=1 -> row

0    1.111257
1    0.007134
2    1.169300
3    0.250189
4   -0.138472
dtype: float64

## * Element Wise : applymap()
###  - Takes a single value and returns a single value.

In [62]:
df.applymap(lambda x:x*100)

C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\1004646656.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x*100)

         col1        col2        col3
0   87.841521  153.563921   91.971658
1   12.927005   66.089827  -76.876514
2  167.228389   97.718799   85.842768
3    8.164081  -46.260673  113.153312
4 -125.850647   -7.870559   92.179663

## Reindexing 
### - changes the row labels and column labels of a DataFrame.

In [63]:
N=7
df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='Y'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})

C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\3408279590.py:3: FutureWarning: 'Y' is deprecated and will be removed in a future version, please use 'YE' instead.
  'A': pd.date_range(start='2016-01-01',periods=N,freq='Y'),

In [64]:
df

           A    x         y       C           D
0 2016-12-31  0.0  0.374945    High  102.932473
1 2017-12-31  1.0  0.386633  Medium  116.990339
2 2018-12-31  2.0  0.980273  Medium   82.313345
3 2019-12-31  3.0  0.981037     Low  107.448058
4 2020-12-31  4.0  0.793767     Low   84.004068
5 2021-12-31  5.0  0.586200  Medium   83.508966
6 2022-12-31  6.0  0.779063    High   89.808583

In [65]:
df.reindex(index=[0,2,4], columns=['A', 'C', 'B'])

           A       C   B
0 2016-12-31    High NaN
2 2018-12-31  Medium NaN
4 2020-12-31     Low NaN

## Reindex to Align with Other Objects
### You may wish to take an object and reindex its axes to be labeled the same as another object.

In [66]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])

df1 = df1.reindex_like(df2)
df1

       col1      col2      col3
0  1.049560 -0.670959  1.109426
1 -0.312968  0.540625  0.831781
2  1.397845 -1.362085 -1.058228
3  0.944157  0.680151  0.148107
4  1.901106 -0.889368  0.121482
5 -0.362002  0.073676  0.333829
6  0.628163  1.026652 -0.111957

## Filling while ReIndexing
### - pad/ffill − Fill values forward
### - bfill/backfill − Fill values backward
### - nearest − Fill from the nearest index values

In [67]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])
df2.reindex_like(df1) # Padding NAN's

       col1      col2      col3
0 -0.911942 -2.436756  0.081435
1  0.484904 -0.766430  0.547525
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [68]:
df2.reindex_like(df1,method='ffill')

       col1      col2      col3
0 -0.911942 -2.436756  0.081435
1  0.484904 -0.766430  0.547525
2  0.484904 -0.766430  0.547525
3  0.484904 -0.766430  0.547525
4  0.484904 -0.766430  0.547525
5  0.484904 -0.766430  0.547525

## Limits on Filling while Reindexing
### - The limit argument provides additional control over filling while reindexing.
### - Limit specifies the maximum count of consecutive matches

In [69]:
df2.reindex_like(df1,method='ffill',limit=2)

       col1      col2      col3
0 -0.911942 -2.436756  0.081435
1  0.484904 -0.766430  0.547525
2  0.484904 -0.766430  0.547525
3  0.484904 -0.766430  0.547525
4       NaN       NaN       NaN
5       NaN       NaN       NaN

## Renaming
### rename()  - allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [70]:
df

           A    x         y       C           D
0 2016-12-31  0.0  0.374945    High  102.932473
1 2017-12-31  1.0  0.386633  Medium  116.990339
2 2018-12-31  2.0  0.980273  Medium   82.313345
3 2019-12-31  3.0  0.981037     Low  107.448058
4 2020-12-31  4.0  0.793767     Low   84.004068
5 2021-12-31  5.0  0.586200  Medium   83.508966
6 2022-12-31  6.0  0.779063    High   89.808583

In [71]:
df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'},index = {0 : 'apple', 1 : 'banana', 2 : 'grapes'})

              c1        c2      col3
apple  -0.191607 -0.872278 -0.573131
banana -0.035916  1.059658  0.886836
grapes  0.329455  0.079449  0.476608
3       0.526089 -0.861447  1.538161
4       1.179760  1.355544  0.568739
5      -0.574374  0.780266  0.851437

## Iteration
### The behavior of basic iteration over Pandas objects depends on the type
### * Series − values
### * DataFrame − column labels

## Iterating a DataFrame

In [72]:
df

           A    x         y       C           D
0 2016-12-31  0.0  0.374945    High  102.932473
1 2017-12-31  1.0  0.386633  Medium  116.990339
2 2018-12-31  2.0  0.980273  Medium   82.313345
3 2019-12-31  3.0  0.981037     Low  107.448058
4 2020-12-31  4.0  0.793767     Low   84.004068
5 2021-12-31  5.0  0.586200  Medium   83.508966
6 2022-12-31  6.0  0.779063    High   89.808583

In [73]:
for col in df:
   print(col)

A
x
y
C
D

## To iterate over the rows of the DataFrame
### * iteritems() − to iterate over the (key,value) pairs
### * iterrows() − iterate over the rows as (index,series) pairs
### * itertuples() − iterate over the rows as namedtuples

In [74]:
df = df.drop(index=[4,5,6])
df = df.drop(columns=['y', 'C', 'D'])
df

           A    x
0 2016-12-31  0.0
1 2017-12-31  1.0
2 2018-12-31  2.0
3 2019-12-31  3.0

In [75]:
for key, value in df.items():
    print(f'key: {key},\nvalue:\n{value}\n')

key: A,
value:
0   2016-12-31
1   2017-12-31
2   2018-12-31
3   2019-12-31
Name: A, dtype: datetime64[ns]

key: x,
value:
0    0.0
1    1.0
2    2.0
3    3.0
Name: x, dtype: float64

In [76]:
for row_index,row in df.iterrows():
   print(row_index, row)

0 A    2016-12-31 00:00:00
x                    0.0
Name: 0, dtype: object
1 A    2017-12-31 00:00:00
x                    1.0
Name: 1, dtype: object
2 A    2018-12-31 00:00:00
x                    2.0
Name: 2, dtype: object
3 A    2019-12-31 00:00:00
x                    3.0
Name: 3, dtype: object

In [77]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, A=Timestamp('2016-12-31 00:00:00'), x=0.0)
Pandas(Index=1, A=Timestamp('2017-12-31 00:00:00'), x=1.0)
Pandas(Index=2, A=Timestamp('2018-12-31 00:00:00'), x=2.0)
Pandas(Index=3, A=Timestamp('2019-12-31 00:00:00'), x=3.0)

### Iterator returns a copy of the original object (a view), thus the changes will not reflect on the original object.

In [78]:
for index, row in df.iterrows():
    row['x'] = 10
    print(f'Inside loop x values: {row["x"]}')
print(f'Original dataframe: {df}')

Inside loop x values: 10
Inside loop x values: 10
Inside loop x values: 10
Inside loop x values: 10
Original dataframe:            A    x
0 2016-12-31  0.0
1 2017-12-31  1.0
2 2018-12-31  2.0
3 2019-12-31  3.0

## Sorting 
### * By label
### * By Actual Value

In [79]:
uns_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])
uns_df

       col2      col1
1  1.139966 -0.277224
4  0.225704  0.196322
6 -0.744605  0.411302
2  0.282519 -0.832427
3 -0.183005 -0.259638
5  0.490445  0.529414
9 -0.680340 -0.416962
8  1.086840 -0.407573
0  0.499414 -0.111043
7 -0.252085 -0.878817

### sort_index() - sorting is done on row labels in ascending order(by default)

In [80]:
uns_df.sort_index()

       col2      col1
0  0.499414 -0.111043
1  1.139966 -0.277224
2  0.282519 -0.832427
3 -0.183005 -0.259638
4  0.225704  0.196322
5  0.490445  0.529414
6 -0.744605  0.411302
7 -0.252085 -0.878817
8  1.086840 -0.407573
9 -0.680340 -0.416962

## Order of Sorting

In [81]:
uns_df.sort_index(ascending=False)

       col2      col1
9 -0.680340 -0.416962
8  1.086840 -0.407573
7 -0.252085 -0.878817
6 -0.744605  0.411302
5  0.490445  0.529414
4  0.225704  0.196322
3 -0.183005 -0.259638
2  0.282519 -0.832427
1  1.139966 -0.277224
0  0.499414 -0.111043

## Sort the Columns

In [82]:
uns_df.sort_index(axis=1, ascending=False)

       col2      col1
1  1.139966 -0.277224
4  0.225704  0.196322
6 -0.744605  0.411302
2  0.282519 -0.832427
3 -0.183005 -0.259638
5  0.490445  0.529414
9 -0.680340 -0.416962
8  1.086840 -0.407573
0  0.499414 -0.111043
7 -0.252085 -0.878817

## sort_values() -  provides a provision to choose the algorithm from mergesort, heapsort and quicksort

In [83]:
uns_df.sort_values(by='col2' ,kind='mergesort')

       col2      col1
6 -0.744605  0.411302
9 -0.680340 -0.416962
7 -0.252085 -0.878817
3 -0.183005 -0.259638
4  0.225704  0.196322
2  0.282519 -0.832427
5  0.490445  0.529414
0  0.499414 -0.111043
8  1.086840 -0.407573
1  1.139966 -0.277224

#  Options and Customization
## get_option() -  takes a single parameter and returns the value
## set_option() - takes two arguments and sets the value to the parameter
## reset_option() - takes an argument and sets the value back to the default value
## describe_option() - prints the description of the argument
## option_context() -  set the option in with statement temporarily

In [84]:
pd.get_option("display.max_rows")

60

In [85]:
pd.set_option("display.max_columns",30)
pd.get_option("display.max_columns")

30

In [86]:
pd.describe_option("display.max_rows")

display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]

In [87]:
with pd.option_context("display.max_rows",23):
   print(pd.get_option("display.max_rows"))
   print(pd.get_option("display.max_rows"))

23
23

#  Indexing and Selecting Data
## .loc() - label based indexing
## - multiple access methods like - A single scalar label, A list of labels, A slice object, A Boolean array

In [88]:
df

           A    x
0 2016-12-31  0.0
1 2017-12-31  1.0
2 2018-12-31  2.0
3 2019-12-31  3.0

In [89]:
df.loc[:,'A'] # select all rows for a specific column

0   2016-12-31
1   2017-12-31
2   2018-12-31
3   2019-12-31
Name: A, dtype: datetime64[ns]

In [90]:
df.loc[:,['A','x']] # Select all rows for multiple columns, say list[]

           A    x
0 2016-12-31  0.0
1 2017-12-31  1.0
2 2018-12-31  2.0
3 2019-12-31  3.0

In [91]:
df.loc[[2],['A']] # Select few rows for multiple columns, say list[]

           A
2 2018-12-31

In [92]:
df.loc[1]['x'] > 0 # for getting values with a boolean array

np.True_

## .iloc()
### Pandas provide various methods in order to get purely integer based indexing
### various access methods - An Integer, A list of integers, A range of values

In [93]:
 df.iloc[:2] # select all rows for a specific column

           A    x
0 2016-12-31  0.0
1 2017-12-31  1.0

In [94]:
df.iloc[1:4, 1:2]

     x
1  1.0
2  2.0
3  3.0

# Statistical Functions
## pct_change() - This function compares every element with its prior element and computes the change percentage.

In [95]:
s = pd.Series([1,2,3,4,5,4])
s.pct_change()

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64

#### By default, the pct_change() operates on columns; if you want to apply the same row wise, then use axis=1() argument.

## Covariance
### The Series object has a method cov to compute covariance between series objects

In [96]:
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
print(s1.cov(s2))

-0.35465947356753097

### Covariance method when applied on a DataFrame, computes cov between all the columns

In [97]:
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
print(frame['a'].cov(frame['b']))
print(frame.cov())

-0.12797689278206922
          a         b         c         d         e
a  0.710390 -0.127977 -0.078276  0.331339 -0.511949
b -0.127977  0.631630  0.783910  0.013824  0.056152
c -0.078276  0.783910  1.799961 -0.274820  0.010443
d  0.331339  0.013824 -0.274820  0.886101 -0.408468
e -0.511949  0.056152  0.010443 -0.408468  1.619065

## Correlation
### Correlation shows the linear relationship between any two array of values (series). 
### There are multiple methods to compute the correlation like pearson(default), spearman and kendall.

In [98]:
frame['a'].corr(frame['b'])

np.float64(-0.1910520852501092)

In [99]:
frame.corr()

          a         b         c         d         e
a  1.000000 -0.191052 -0.069222  0.417621 -0.477360
b -0.191052  1.000000  0.735196  0.018479  0.055527
c -0.069222  0.735196  1.000000 -0.217608  0.006117
d  0.417621  0.018479 -0.217608  1.000000 -0.341024
e -0.477360  0.055527  0.006117 -0.341024  1.000000

## Data Ranking
### Data Ranking produces ranking for each element in the array of elements. In case of ties, assigns the mean rank.

In [100]:
s = pd.Series(np.random.randn(5), index=list('abcde'))
s['d'] = s['b'] # so there's a tie
s.rank()

a    1.0
b    4.5
c    2.0
d    4.5
e    3.0
dtype: float64

# Missing Data

In [101]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

In [102]:
df

        one       two     three
a -1.462623 -0.796376  0.113330
c  0.883470  0.124316  0.186860
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
h  1.473899 -0.702578  0.481503

In [103]:
# Using reindexing, create a DataFrame with missing values
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [104]:
df

        one       two     three
a -1.462623 -0.796376  0.113330
b       NaN       NaN       NaN
c  0.883470  0.124316  0.186860
d       NaN       NaN       NaN
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
g       NaN       NaN       NaN
h  1.473899 -0.702578  0.481503

## Check for Missing Values
### isnull() - returns True if element is 'NaN' else False
### notnull() - returns False if element is 'NaN' else True

In [105]:
df.isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [106]:
df.notnull()

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

## Calculations with Missing Data
### * When summing data, NaN will be treated as Zero

In [107]:
df['one'].sum()

np.float64(-0.5053905809208593)

In [108]:
df2 = pd.DataFrame(index=[0,1,2,3,4,5],columns=['one','two'])
df2

   one  two
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN
5  NaN  NaN

In [109]:
df2['one'].sum()

0

## Cleaning / Filling Missing Data
### fillna() - fills nan values with non-null data by

In [110]:
df

        one       two     three
a -1.462623 -0.796376  0.113330
b       NaN       NaN       NaN
c  0.883470  0.124316  0.186860
d       NaN       NaN       NaN
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
g       NaN       NaN       NaN
h  1.473899 -0.702578  0.481503

In [111]:
df.fillna(0)

        one       two     three
a -1.462623 -0.796376  0.113330
b  0.000000  0.000000  0.000000
c  0.883470  0.124316  0.186860
d  0.000000  0.000000  0.000000
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
g  0.000000  0.000000  0.000000
h  1.473899 -0.702578  0.481503

## Drop Missing Values
### dropna -  exclude the missing values

In [112]:
df

        one       two     three
a -1.462623 -0.796376  0.113330
b       NaN       NaN       NaN
c  0.883470  0.124316  0.186860
d       NaN       NaN       NaN
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
g       NaN       NaN       NaN
h  1.473899 -0.702578  0.481503

In [113]:
df.dropna()

        one       two     three
a -1.462623 -0.796376  0.113330
c  0.883470  0.124316  0.186860
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
h  1.473899 -0.702578  0.481503

## Replace Missing (or) Generic Values

In [114]:
df

        one       two     three
a -1.462623 -0.796376  0.113330
b       NaN       NaN       NaN
c  0.883470  0.124316  0.186860
d       NaN       NaN       NaN
e -1.050171 -0.624912 -0.857531
f -0.349966 -0.300608  1.167130
g       NaN       NaN       NaN
h  1.473899 -0.702578  0.481503

In [115]:
df.replace({np.nan:10})

         one        two      three
a  -1.462623  -0.796376   0.113330
b  10.000000  10.000000  10.000000
c   0.883470   0.124316   0.186860
d  10.000000  10.000000  10.000000
e  -1.050171  -0.624912  -0.857531
f  -0.349966  -0.300608   1.167130
g  10.000000  10.000000  10.000000
h   1.473899  -0.702578   0.481503

# Groupby Operation 
## 1. Splitting the Object 
split the data into sets and apply some functionality on each subset
multiple ways to split an object 
* obj.groupby('key')
* obj.groupby(['key1','key2'])
* obj.groupby(key,axis=1)

## 2. Applying a function
### 2.1 Aggregation − computing a summary statistic
### 2.2 Transformation − perform some group-specific operation
### 2.3 Filtration − discarding the data with some condition
## 3. Combining the results

In [116]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [117]:
df.groupby('Team').groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [118]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [119]:
grouped = df.groupby('Year')
grouped

In [120]:
for name, group in grouped:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

### get_group -  we can select a single group

In [121]:
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

## Aggregations
### An aggregated function returns a single aggregated value for each group.
### Once the group by object is created, several aggregation operations can be performed on the grouped data.

In [122]:
grouped['Points'].agg(np.mean)

C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\1565718622.py:1: FutureWarning: The provided callable <function mean at 0x00000251C56678B0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [123]:
grouped.agg(np.size)

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [124]:
grouped['Points'].agg([np.sum, np.mean, np.std]) # Applying Multiple Aggregation Functions

C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\1914380126.py:1: FutureWarning: The provided callable <function sum at 0x00000251C5663940> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped['Points'].agg([np.sum, np.mean, np.std]) # Applying Multiple Aggregation Functions
C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\1914380126.py:1: FutureWarning: The provided callable <function mean at 0x00000251C56678B0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  grouped['Points'].agg([np.sum, np.mean, np.std]) # Applying Multiple Aggregation Functions
C:\Users\3KT\AppData\Local\Temp\ipykernel_19208\1914380126.py:1: FutureWarning: The provided callable <function std at 0x00000251C56679D0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped['Points'].agg([np.sum, np.mean, np.std]) # Applying Multiple Aggregation Functions

       sum    mean        std
Year
2014  3181  795.25  87.439026
2015  3078  769.50  65.035888
2016  1450  725.00  43.840620
2017  1478  739.00  69.296465

## Transformations
### Transformation on a group or a column returns an object that is indexed the same size of that is being grouped.
### returns a result that is the same size as that of a group chunk.

In [125]:
grouped = df.groupby('Team')
score = lambda x: x * 10
score

In [126]:
grouped.transform(score)

    Rank   Year  Points
0     10  20140    8760
1     20  20150    7890
2     20  20140    8630
3     30  20150    6730
4     30  20140    7410
5     40  20150    8120
6     10  20160    7560
7     10  20170    7880
8     20  20160    6940
9     40  20140    7010
10    10  20150    8040
11    20  20170    6900

## Filtration
###  filters the data on a defined criteria and returns the subset of data

In [127]:
grouped = df.groupby('Team')
grouped.groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [128]:
grouped.filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

# Merging/Joining
### full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.
### merge - pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,left_index=False, right_index=False, sort=True)
#### left − A DataFrame object.
#### right − Another DataFrame object.
#### on − Columns (names) to join on. Must be found in both the left and right DataFrame objects.
#### left_on − Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
#### right_on − Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
#### left_index − If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.
#### right_index − Same usage as left_index for the right DataFrame.
#### how − One of 'left', 'right', 'outer', 'inner'. Defaults to inner
#### sort − Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

## Dataframe args

In [129]:
from io import StringIO, BytesIO

In [130]:
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [131]:
ddf = pd.read_csv(StringIO(data))
ddf

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

### Usecols

In [132]:
uddf = pd.read_csv(StringIO(data), usecols=['col1', 'col3'])
uddf

  col1  col3
0    x     1
1    a     2
2    c     3

### dtype

In [133]:
df = pd.read_csv(StringIO(data), dtype={'col1':object,'col3':float})
df

  col1 col2  col3
0    x    y   1.0
1    a    b   2.0
2    c    d   3.0

### indexcol

In [134]:
data = ('index,a,b,c\n'
            '4,apple,fruit,5,7\n'
            '8,orange,juice,10')

In [135]:
df = pd.read_csv(StringIO(data), index_col=0)
df

    index      a   b    c
4   apple  fruit   5  7.0
8  orange  juice  10  NaN

In [136]:
data = ('a,b,c\n'
            '4,apple,fruit,\n'
            '8,orange,juice')

In [137]:
pd.read_csv(StringIO(data), index_col=False)

   a       b      c
0  4   apple  fruit
1  8  orange  juice

In [138]:
data = 'a,b\n"hello, \\"Bob\\",nice to see you",5'

In [139]:
pd.read_csv(StringIO(data), escapechar='\\')

                              a  b
0  hello, "Bob",nice to see you  5